{
  "praise": [
    "Your story has a great rhythm - it's easy and enjoyable to read.",
    "The images are very vivid, especially the scene with the lantern - it creates a strong atmosphere.",
    "Your ending is emotional, even if it's unexpected.",
    "The dialogue feels natural and reveals character personalities well.",
    "You've created a wonderful sense of place - the reader can really visualize the setting.",
    "The pacing keeps the reader engaged throughout.",
    "Your character's voice is distinct and memorable.",
    "The sensory details make the story come alive.",
    "You've balanced action and reflection beautifully.",
    "The emotional arc of your story is compelling.",
    "Your descriptions are precise without being overwrought.",
    "The story has a unique perspective that stands out.",
    "You've created genuine tension that keeps readers hooked.",
    "The character development feels authentic and earned.",
    "Your word choices create a specific mood effectively.",
    "The story's theme emerges naturally from the narrative.",
    "You've shown great restraint - nothing feels excessive.",
    "The relationships between characters feel real and complex.",
    "Your metaphors enhance rather than distract from the story.",
    "The story's structure supports its emotional impact.",
    "You've created moments of genuine surprise.",
    "The character's motivations are clear and believable.",
    "Your descriptions engage multiple senses effectively.",
    "The story has a strong sense of authenticity.",
    "You've crafted memorable imagery that lingers.",
    "The emotional beats land exactly where they should.",
    "Your narrative voice is confident and assured.",
    "The story feels complete, even in its brevity.",
    "You've created a world that feels lived-in and real.",
    "The character's journey feels meaningful and earned.",
    "Your writing shows careful attention to detail.",
    "The story has layers that reward re-reading.",
    "You've balanced showing and telling skillfully.",
    "The emotional honesty of the piece is striking.",
    "Your character interactions reveal depth and history.",
    "The story's atmosphere is palpable and immersive.",
    "You've used subtext effectively throughout.",
    "The narrative has a natural, organic flow.",
    "Your descriptions create vivid mental pictures.",
    "The story demonstrates strong craft and control."
  ],
  "hints": [
    "Try adding a little more of the character's thoughts - this will deepen the connection with the reader.",
    "Maybe it's worth clarifying the character's motivation at a key moment.",
    "Dialogues that sound natural - this is a big advantage.",
    "Think about whether you can expand the description of the location a little - this will add depth.",
    "The pacing is good, but consider if any moments need more space to breathe.",
    "Your character could reveal more through actions rather than thoughts.",
    "Consider adding more conflict to raise the stakes.",
    "The ending might benefit from a bit more foreshadowing.",
    "Some descriptions could be tightened for greater impact.",
    "Think about varying sentence length to enhance rhythm.",
    "Consider showing the character's emotions through physical reactions.",
    "The setting could play a larger role in the story.",
    "Some dialogue could be cut to increase tension.",
    "Consider adding a moment of silence or pause for emphasis.",
    "Think about whether all explanations are necessary.",
    "The character's backstory could be woven in more subtly.",
    "Consider starting closer to the main action.",
    "Some scenes might benefit from more sensory details.",
    "Think about the balance between action and reflection.",
    "Consider whether every word is earning its place.",
    "The theme could emerge more naturally from events.",
    "Some metaphors might be working too hard.",
    "Consider letting readers draw more conclusions themselves.",
    "Think about varying the emotional intensity throughout.",
    "The transitions between scenes could be smoother.",
    "Consider if any description is telling instead of showing.",
    "Some character reactions might need more specificity.",
    "Think about the story's opening - does it hook immediately?",
    "Consider whether the pacing matches the story's emotional arc.",
    "Some details might be more powerful if implied rather than stated.",
    "Think about using more specific verbs instead of adverbs.",
    "Consider if dialogue tags are always necessary.",
    "The character's wants vs. needs could be clearer.",
    "Think about creating more contrast between scenes.",
    "Consider if backstory is revealed at the right moments.",
    "Some exposition could be converted to action.",
    "Think about whether all subplots serve the main story.",
    "Consider adding more obstacles to the character's journey.",
    "The story's central question could be established earlier.",
    "Think about whether the ending resonates with the opening."
  ]
}
